#### MacroModule Members

---

|  |
| --- |
| MacroModule Class   Methods   Properties   See Also |

The  MacroModule  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | AddMacro | Adds a macro to the module. |
| Public method | Dispose | Releases all resources used by the  MacroModule |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Protected method | GetBasicIEnumerator | Returns an enumerator that iterates through a collection. |
| Public method | GetEnumerator | Returns an enumerator that iterates through a collection. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetMacro | Gets the macro with the give name. |
| Public method | GetMacroModuleIterator | Returns a Macro module iterator that iterates through the collection. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | RemoveMacro | Removes a macro from the module. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Description | The module description. |
| Public property | Environment | The Macro environment. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | MacroLanguageType | The Macro language type. |
| Public property | MacroLevel | The Macro level. |
| Public property | MacroManager | The Macro manager. |
| Public property | ModuleStatus | The module status. |
| Public property | Name | The name of the module. |

# See Also

MacroModule Class

Autodesk.Revit.DB.Macros Namespace